create_clock -name clk -period 10 -waveform {0 5} [get_ports clk]
set_clock_latency 0.4 [get_clocks clk]
set_clock_uncertainty 0.05 [get_clocks clk]
set_clock_transition 0.1 [get_clocks clk]
set_input_delay -clock clk -network_latency_included -max 1 [all_inputs]
set_input_delay -clock clk -network_latency_included -min 0.4 [all_inputs]
set_output_delay -clock clk -network_latency_included -max 1 [all_outputs]
set_output_delay -clock clk -network_latency_included -min 0.4 [all_outputs]
set_load 0.5 -max [all_outputs]
set_load 0.01 -min [all_outputs]
set_driving_cell -lib_cell BUFX2 -min [all_inputs]
set_driving_cell -lib_cell BUFX16 -max [all_inputs]
